from math import sqrt

# 2. Написати функцію яка приймає два катети і повертає значення гіпотензузи. Написати декоратор на функцію,
# який виводить на екран текст з довжиною катетів і гіпотенузи.
# Важливо! Функція повинно повернути саме значення гіпотенузи як число, а декоратор повинен зробити вивід на екран
# наприклад такого тексту “При катетах 3, 4 – гіпотенуза дорівнює 5”.


def decor_text(hyp):
    def wrap(leg1, leg2):
        print(f"При катетах {leg1} та {leg2} - гіпотенуза дорівнює {hyp(leg1, leg2)}")
    return wrap


@decor_text
def hyp_(leg1, leg2):
    return sqrt(leg1 ** 2 + leg2 ** 2)


hyp_(3, 4)